#include <stdio.h>

int main() {
    int product = 1;
    //Перед початком виконання циклу for, ініціалізується змінна i зі значенням 22, яка представляє перше число у діапазоні. 
    //Умова виконання циклу є i <= 100, що означає, що цикл буде виконуватись до тих пір, поки i буде менше або дорівнювати 100. 
    for (int i = 22; i <= 100; i++) {
        if (i % 7 == 0) {
            product *= i;
        }
    }
    printf("Добуток всіх чисел, кратних 7, у діапазоні (21;100]: %d\n", product);
    return 0;
}